Fleming2020/20191225/precursor/constant/drivingData/fieldTable_z50
sourceHeightsMomentum
(
    50
);

sourceTableMomentumX
(
    (0 1.12818294946)
    (600 1.61862064576)
    (1200 0.937841012281)
    (1800 1.18394462725)
    (2400 2.65205803397)
    (3000 2.853202042)
    (3600 2.72316112753)
    (4200 0.72429606616)
    (4800 0.187053866413)
    (5400 -0.271951661795)
    (6000 -0.366579002436)
    (6600 -0.324271003706)
    (7200 -0.274022605902)
    (7800 -0.0947650215679)
    (8400 0.221996000029)
    (9000 0.0984926486924)
    (9600 0.0993733174177)
    (10200 0.656280216797)
    (10800 1.13322983712)
    (11400 0.744536788365)
    (12000 1.02189589707)
    (12600 0.871622547546)
    (13200 0.713580784282)
    (13800 1.56206337619)
    (14400 1.36793157847)
    (15000 1.62042131275)
    (15600 1.04188727192)
    (16200 1.41347925612)
    (16800 0.450837583598)
    (17400 0.225465523817)
    (18000 0.227196085483)
    (18600 0.430085376283)
    (19200 0.82640547464)
    (19800 0.394100772232)
    (20400 -0.222996777086)
    (21000 -0.437513654915)
    (21600 -0.0739295279969)
    (22200 0.23136957875)
    (22800 0.541069901828)
    (23400 0.591774181783)
    (24000 0.919122923583)
    (24600 1.04693082275)
    (25200 1.15742176735)
    (25800 0.82350798894)
    (26400 -0.370023524924)
    (27000 0.250075636474)
    (27600 0.148255414694)
    (28200 0.044936461716)
    (28800 0.517819395293)
    (29400 1.48191298802)
    (30000 0.950008407543)
    (30600 0.413363989141)
    (31200 0.70105037576)
    (31800 0.382271786755)
    (32400 0.220292791395)
    (33000 0.469820549454)
    (33600 -0.291559805603)
    (34200 -0.55192123252)
    (34800 -0.511171012647)
    (35400 -0.914533258969)
    (36000 -0.433848130623)
    (36600 -0.91234450403)
    (37200 1.24630358097)
    (37800 2.86314141568)
    (38400 3.51717974507)
    (39000 3.84309436999)
    (39600 4.92076399145)
    (40200 9.67308432386)
    (40800 9.14847770173)
    (41400 12.1255691237)
    (42000 11.0097154425)
    (42600 9.27163045192)
    (43200 8.61985955161)
    (43800 3.22861443386)
    (44400 2.53821182562)
    (45000 2.72508814081)
    (45600 2.9029522893)
    (46200 2.2729162846)
    (46800 2.41761129434)
    (47400 3.36586633124)
    (48000 4.93961903991)
    (48600 5.27192385556)
    (49200 4.51979136073)
    (49800 3.17590701237)
    (50400 1.8606766853)
    (51000 -0.720336585917)
    (51600 0.090390155362)
    (52200 0.473702220995)
    (52800 -0.762558397104)
    (53400 -2.08143959783)
    (54000 -2.76471310238)
    (54600 -3.90691963407)
    (55200 -2.66509158212)
    (55800 -1.42857650464)
    (56400 -0.0228991187161)
    (57000 -0.022932613869)
    (57600 0.188076789479)
    (58200 -0.21016762392)
    (58800 -0.437795891461)
    (59400 1.11185316684)
    (60000 0.692275380476)
    (60600 1.34586016959)
    (61200 0.300428668844)
    (61800 0.908206450988)
    (62400 1.13536358155)
    (63000 2.02613327446)
    (63600 2.63277033695)
    (64200 1.53279726535)
    (64800 1.39565184722)
    (65400 1.1895653189)
    (66000 1.11490193187)
    (66600 1.94024827562)
    (67200 2.53340227293)
    (67800 2.75605146482)
    (68400 2.0773691632)
    (69000 2.67316953772)
    (69600 2.88463948751)
    (70200 2.8878049231)
    (70800 2.33316771632)
    (71400 1.67242717806)
    (72000 2.16392619393)
    (72600 2.87779965716)
    (73200 2.52763134125)
    (73800 3.06513137402)
    (74400 3.70527698334)
    (75000 2.91868752855)
    (75600 2.19072257922)
    (76200 1.8017655017)
    (76800 1.24930350706)
    (77400 0.800138352462)
    (78000 0.89307487832)
    (78600 0.667787864376)
    (79200 0.930314828831)
    (79800 1.65214274918)
    (80400 1.42735787748)
    (81000 1.36013428635)
    (81600 1.52605554424)
    (82200 1.49647728413)
    (82800 1.17833110029)
    (83400 1.24802061516)
    (84000 1.28677671142)
    (84600 1.5623121531)
    (85200 1.52402657681)
    (85800 1.75465198464)
    (86400 1.70049391168)
    (87000 1.65527817382)
    (87600 1.47780913047)
    (88200 1.53303004754)
    (88800 1.67357397925)
    (89400 2.26052263581)
    (90000 2.63123906013)
    (90600 2.72115462808)
    (91200 2.93745837048)
    (91800 3.16215418493)
    (92400 3.62896288298)
    (93000 2.61914104166)
    (93600 2.74266715476)
    (94200 2.59999132331)
    (94800 2.0640519257)
    (95400 1.51852985093)
    (96000 1.23286763177)
    (96600 1.068808866)
    (97200 1.68317404209)
    (97800 1.60250075701)
    (98400 0.840261794845)
    (99000 0.766363294937)
    (99600 0.452289448525)
    (100200 1.72679259304)
    (100800 2.21122256425)
    (101400 2.16298513503)
    (102000 1.86562912244)
    (102600 1.78518558161)
    (103200 1.08433986726)
    (103800 1.277861795)
    (104400 1.58340751852)
    (105000 1.33115896585)
    (105600 1.49610745517)
    (106200 2.79366686465)
    (106800 2.38217426354)
    (107400 2.19951926561)
    (108000 2.59261711751)
);

sourceTableMomentumY
(
    (0 -8.72915281244)
    (600 -8.0836511369)
    (1200 -8.31302825718)
    (1800 -8.39276625535)
    (2400 -5.07688581226)
    (3000 -4.19527520212)
    (3600 0.0443437954565)
    (4200 1.01435812339)
    (4800 2.0082148328)
    (5400 0.836098862117)
    (6000 -0.780381048057)
    (6600 -1.00900328958)
    (7200 -1.52642239678)
    (7800 -2.41604908073)
    (8400 -3.15809605492)
    (9000 -3.38167841129)
    (9600 -2.72405002847)
    (10200 -1.67727796233)
    (10800 -0.654843317708)
    (11400 0.446685213968)
    (12000 0.98182893374)
    (12600 0.156251552986)
    (13200 0.582913611655)
    (13800 0.842427051716)
    (14400 0.958964531925)
    (15000 1.011033577)
    (15600 0.589318133904)
    (16200 0.387332723484)
    (16800 -0.253020815765)
    (17400 -0.609616550815)
    (18000 -1.34978156712)
    (18600 -1.30676072189)
    (19200 -1.96507668789)
    (19800 -2.59464930009)
    (20400 -2.42090025073)
    (21000 -2.35992373197)
    (21600 -2.23738167639)
    (22200 -2.65409028216)
    (22800 -2.5229799521)
    (23400 -3.08278407426)
    (24000 -3.59760602337)
    (24600 -3.54306247823)
    (25200 -4.34175465353)
    (25800 -3.97248792015)
    (26400 -4.33064545342)
    (27000 -3.90129777555)
    (27600 -4.03026960031)
    (28200 -3.96157307206)
    (28800 -3.23348569508)
    (29400 -3.19252069982)
    (30000 -3.59860717581)
    (30600 -3.74039498017)
    (31200 -3.99989400031)
    (31800 -4.80876990082)
    (32400 -5.33511395385)
    (33000 -5.06353523668)
    (33600 -4.76791553309)
    (34200 -4.58552473857)
    (34800 -5.45386372491)
    (35400 -6.01484664281)
    (36000 -6.47652763599)
    (36600 -7.23992175765)
    (37200 -7.87954873951)
    (37800 -7.77892446726)
    (38400 -8.65312676484)
    (39000 -9.28434108988)
    (39600 -8.2333156906)
    (40200 -8.76936548084)
    (40800 -7.91578865547)
    (41400 -9.24385799953)
    (42000 -8.57417559644)
    (42600 -7.91581586185)
    (43200 -5.27900298125)
    (43800 -0.262001409604)
    (44400 -6.14814017108)
    (45000 -8.18644489262)
    (45600 -8.97810852723)
    (46200 -9.26658577548)
    (46800 -8.28705009615)
    (47400 -7.35021374466)
    (48000 -9.47598969837)
    (48600 -11.3767851208)
    (49200 -12.0612219672)
    (49800 -12.0702544261)
    (50400 -12.4734633704)
    (51000 -12.3018839248)
    (51600 -9.96042464214)
    (52200 -7.66590452938)
    (52800 -6.27024074129)
    (53400 -5.80229048762)
    (54000 -5.81510182887)
    (54600 -5.37601526234)
    (55200 -5.76862226977)
    (55800 -3.9749322531)
    (56400 -3.4702339648)
    (57000 -4.29546338311)
    (57600 -4.46187753782)
    (58200 -5.01651029164)
    (58800 -5.14240828973)
    (59400 -4.67748707766)
    (60000 -4.81901447293)
    (60600 -4.63000460024)
    (61200 -4.46957985856)
    (61800 -4.17438413673)
    (62400 -3.82317795142)
    (63000 -3.57473243676)
    (63600 -2.88588759371)
    (64200 -0.705590261793)
    (64800 -0.986336480102)
    (65400 -0.515229353708)
    (66000 -1.82161661027)
    (66600 -3.01944511187)
    (67200 -3.49635733911)
    (67800 -3.64080545497)
    (68400 -3.39585141423)
    (69000 -4.30954161685)
    (69600 -4.64604443186)
    (70200 -5.98051606197)
    (70800 -5.97615325959)
    (71400 -5.62807609622)
    (72000 -5.80336333622)
    (72600 -5.25202404594)
    (73200 -4.77552844259)
    (73800 -5.34389325361)
    (74400 -5.591879613)
    (75000 -6.20755796978)
    (75600 -5.58751625904)
    (76200 -5.17342061687)
    (76800 -5.20062803831)
    (77400 -5.01017681397)
    (78000 -5.03134515824)
    (78600 -4.46080224361)
    (79200 -4.78538990242)
    (79800 -4.86624243823)
    (80400 -4.50154687091)
    (81000 -4.49594152537)
    (81600 -4.45256724398)
    (82200 -4.38271919547)
    (82800 -3.96158127871)
    (83400 -3.78956473924)
    (84000 -3.68594618605)
    (84600 -3.52861949197)
    (85200 -3.08354153671)
    (85800 -3.52109483675)
    (86400 -4.73837395976)
    (87000 -4.66437149241)
    (87600 -5.02822170847)
    (88200 -4.9598344171)
    (88800 -5.2915429529)
    (89400 -5.43207500023)
    (90000 -5.95371156204)
    (90600 -6.02162764894)
    (91200 -5.70482632139)
    (91800 -5.57724040957)
    (92400 -5.5851215584)
    (93000 -4.86945276882)
    (93600 -4.75223405051)
    (94200 -4.81854628568)
    (94800 -4.86918043868)
    (95400 -4.37452658488)
    (96000 -3.85657449157)
    (96600 -4.15834874417)
    (97200 -4.44085441307)
    (97800 -5.01340390843)
    (98400 -5.00404277891)
    (99000 -4.03369430369)
    (99600 -4.34511086787)
    (100200 -4.90578431417)
    (100800 -4.60431616506)
    (101400 -4.51265667287)
    (102000 -4.51906190147)
    (102600 -3.79194066102)
    (103200 -3.21999400375)
    (103800 -2.66854334663)
    (104400 -1.29227019145)
    (105000 -0.27958146928)
    (105600 -0.938842622256)
    (106200 -3.81900411938)
    (106800 -4.22533916778)
    (107400 -4.86176038118)
    (108000 -4.28829409458)
);

sourceTableMomentumZ
(
    (0 0)
    (600 0)
    (1200 0)
    (1800 0)
    (2400 0)
    (3000 0)
    (3600 0)
    (4200 0)
    (4800 0)
    (5400 0)
    (6000 0)
    (6600 0)
    (7200 0)
    (7800 0)
    (8400 0)
    (9000 0)
    (9600 0)
    (10200 0)
    (10800 0)
    (11400 0)
    (12000 0)
    (12600 0)
    (13200 0)
    (13800 0)
    (14400 0)
    (15000 0)
    (15600 0)
    (16200 0)
    (16800 0)
    (17400 0)
    (18000 0)
    (18600 0)
    (19200 0)
    (19800 0)
    (20400 0)
    (21000 0)
    (21600 0)
    (22200 0)
    (22800 0)
    (23400 0)
    (24000 0)
    (24600 0)
    (25200 0)
    (25800 0)
    (26400 0)
    (27000 0)
    (27600 0)
    (28200 0)
    (28800 0)
    (29400 0)
    (30000 0)
    (30600 0)
    (31200 0)
    (31800 0)
    (32400 0)
    (33000 0)
    (33600 0)
    (34200 0)
    (34800 0)
    (35400 0)
    (36000 0)
    (36600 0)
    (37200 0)
    (37800 0)
    (38400 0)
    (39000 0)
    (39600 0)
    (40200 0)
    (40800 0)
    (41400 0)
    (42000 0)
    (42600 0)
    (43200 0)
    (43800 0)
    (44400 0)
    (45000 0)
    (45600 0)
    (46200 0)
    (46800 0)
    (47400 0)
    (48000 0)
    (48600 0)
    (49200 0)
    (49800 0)
    (50400 0)
    (51000 0)
    (51600 0)
    (52200 0)
    (52800 0)
    (53400 0)
    (54000 0)
    (54600 0)
    (55200 0)
    (55800 0)
    (56400 0)
    (57000 0)
    (57600 0)
    (58200 0)
    (58800 0)
    (59400 0)
    (60000 0)
    (60600 0)
    (61200 0)
    (61800 0)
    (62400 0)
    (63000 0)
    (63600 0)
    (64200 0)
    (64800 0)
    (65400 0)
    (66000 0)
    (66600 0)
    (67200 0)
    (67800 0)
    (68400 0)
    (69000 0)
    (69600 0)
    (70200 0)
    (70800 0)
    (71400 0)
    (72000 0)
    (72600 0)
    (73200 0)
    (73800 0)
    (74400 0)
    (75000 0)
    (75600 0)
    (76200 0)
    (76800 0)
    (77400 0)
    (78000 0)
    (78600 0)
    (79200 0)
    (79800 0)
    (80400 0)
    (81000 0)
    (81600 0)
    (82200 0)
    (82800 0)
    (83400 0)
    (84000 0)
    (84600 0)
    (85200 0)
    (85800 0)
    (86400 0)
    (87000 0)
    (87600 0)
    (88200 0)
    (88800 0)
    (89400 0)
    (90000 0)
    (90600 0)
    (91200 0)
    (91800 0)
    (92400 0)
    (93000 0)
    (93600 0)
    (94200 0)
    (94800 0)
    (95400 0)
    (96000 0)
    (96600 0)
    (97200 0)
    (97800 0)
    (98400 0)
    (99000 0)
    (99600 0)
    (100200 0)
    (100800 0)
    (101400 0)
    (102000 0)
    (102600 0)
    (103200 0)
    (103800 0)
    (104400 0)
    (105000 0)
    (105600 0)
    (106200 0)
    (106800 0)
    (107400 0)
    (108000 0)
);

