Fleming2020/20191225/precursor/constant/drivingData/givenSourceT
    (0 296.002962147)
    (600 295.228182192)
    (1200 294.909257603)
    (1800 294.736934298)
    (2400 292.586844486)
    (3000 291.87603067)
    (3600 290.115519852)
    (4200 290.734018542)
    (4800 291.445118252)
    (5400 290.929718295)
    (6000 291.095007917)
    (6600 291.344764512)
    (7200 290.910653888)
    (7800 290.854216583)
    (8400 290.622218057)
    (9000 290.445891066)
    (9600 290.499088362)
    (10200 290.420539384)
    (10800 290.038063768)
    (11400 290.368824141)
    (12000 290.79128499)
    (12600 290.77620612)
    (13200 290.94629647)
    (13800 291.338409665)
    (14400 291.995020773)
    (15000 292.341217364)
    (15600 292.828126969)
    (16200 293.129015669)
    (16800 293.681631874)
    (17400 294.342682727)
    (18000 294.322517799)
    (18600 294.54438615)
    (19200 294.609971021)
    (19800 294.807645262)
    (20400 294.921417323)
    (21000 295.09610483)
    (21600 295.512116753)
    (22200 295.814897978)
    (22800 295.997785341)
    (23400 296.024927063)
    (24000 296.090614136)
    (24600 296.347109625)
    (25200 296.139337072)
    (25800 296.295098268)
    (26400 296.461288924)
    (27000 296.622123324)
    (27600 296.747555038)
    (28200 296.823512506)
    (28800 296.874482723)
    (29400 296.924799465)
    (30000 296.855013532)
    (30600 296.997961499)
    (31200 296.956389394)
    (31800 296.925827735)
    (32400 296.964684759)
    (33000 296.90328886)
    (33600 296.823731152)
    (34200 296.844243063)
    (34800 296.687235639)
    (35400 296.582768076)
    (36000 296.433653987)
    (36600 296.282148889)
    (37200 295.819583246)
    (37800 295.13138392)
    (38400 295.145562484)
    (39000 295.26593837)
    (39600 294.831275694)
    (40200 293.565068129)
    (40800 292.136235325)
    (41400 292.300299949)
    (42000 292.346847595)
    (42600 292.355022273)
    (43200 293.928136352)
    (43800 294.20994437)
    (44400 293.082393583)
    (45000 293.031570874)
    (45600 293.485375562)
    (46200 293.35552766)
    (46800 292.669691809)
    (47400 291.550458555)
    (48000 290.935026639)
    (48600 290.795728054)
    (49200 290.606956426)
    (49800 290.276337868)
    (50400 290.03533577)
    (51000 289.869162637)
    (51600 289.537022868)
    (52200 289.383534835)
    (52800 289.194279726)
    (53400 289.153365307)
    (54000 289.077733245)
    (54600 289.027081967)
    (55200 289.04865282)
    (55800 288.822398236)
    (56400 288.710653228)
    (57000 288.83264774)
    (57600 288.847044641)
    (58200 288.922255843)
    (58800 288.996281725)
    (59400 288.840265028)
    (60000 289.041302211)
    (60600 289.131469392)
    (61200 289.745038606)
    (61800 289.548609535)
    (62400 289.2028011)
    (63000 289.033484156)
    (63600 288.840553998)
    (64200 288.406836053)
    (64800 288.165643212)
    (65400 288.052351653)
    (66000 287.801381778)
    (66600 287.742298273)
    (67200 287.701323425)
    (67800 287.657786862)
    (68400 287.816148026)
    (69000 287.612279189)
    (69600 287.391465433)
    (70200 287.702387104)
    (70800 287.747473843)
    (71400 287.900963601)
    (72000 287.82978366)
    (72600 287.761066538)
    (73200 287.731578247)
    (73800 287.856947363)
    (74400 288.015614747)
    (75000 287.987539995)
    (75600 287.76713955)
    (76200 287.800163187)
    (76800 287.700959284)
    (77400 287.677011044)
    (78000 287.624593867)
    (78600 287.548037003)
    (79200 287.454767698)
    (79800 287.270577381)
    (80400 287.247694529)
    (81000 287.1625783)
    (81600 287.177969038)
    (82200 287.13382079)
    (82800 286.870961999)
    (83400 286.452709436)
    (84000 286.472795992)
    (84600 286.516247769)
    (85200 286.414801257)
    (85800 286.369184916)
    (86400 286.478903266)
    (87000 286.454438444)
    (87600 286.495438993)
    (88200 286.361911902)
    (88800 286.308315036)
    (89400 286.395191169)
    (90000 286.541087361)
    (90600 286.596264979)
    (91200 286.632358206)
    (91800 286.676162505)
    (92400 286.612916365)
    (93000 286.497417937)
    (93600 286.300307408)
    (94200 286.153220976)
    (94800 286.057341781)
    (95400 285.855415857)
    (96000 285.64159198)
    (96600 285.837391142)
    (97200 286.02142421)
    (97800 285.963369828)
    (98400 285.997524422)
    (99000 286.1364383)
    (99600 285.902631029)
    (100200 285.679677234)
    (100800 285.524271098)
    (101400 285.496704859)
    (102000 285.5890958)
    (102600 285.604666867)
    (103200 285.769569307)
    (103800 286.001775513)
    (104400 286.164263188)
    (105000 286.302455332)
    (105600 286.521700883)
    (106200 286.943519118)
    (106800 287.072426149)
    (107400 286.89969298)
    (108000 286.747171292)
