Fleming2020/20191225/precursor/constant/drivingData/initialValues
    (0 0 -0 287.885012256)
    (5 0.791324356651 -1.79774156783 288.544237975)
    (10 1.5826487133 -3.59548313566 289.203463695)
    (15 1.67839491523 -4.21574146552 289.862689414)
    (20 1.73151887449 -4.84672203852 290.521915133)
    (25 1.74140231285 -5.48616018001 291.181140853)
    (30 1.70753473203 -6.13176165129 291.840366572)
    (35 1.62951470343 -6.78120747232 292.499592291)
    (40 1.50705095041 -7.43215879776 293.158818011)
    (45 1.33996322102 -8.0822618374 293.81804373)
    (50 1.12818294946 -8.72915281244 294.477269449)
    (55 1.21581882241 -8.71737863016 295.136495169)
    (60 1.30333199 -8.70472465471 295.795720888)
    (65 1.39071362005 -8.69119216319 295.834996709)
    (70 1.47795489365 -8.67678252135 295.87427253)
    (75 1.56504700605 -8.66149718347 295.913548351)
    (80 1.65198116757 -8.64533769221 295.952824173)
    (85 1.73874860446 -8.62830567846 295.992099994)
    (90 1.82534055979 -8.61040286114 296.031375815)
    (95 1.91174829437 -8.5916310471 296.070651636)
    (100 1.99796308756 -8.57199213084 296.109927457)
    (105 2.08397623822 -8.55148809442 296.149203278)
    (110 2.16977906556 -8.53012100718 296.188479099)
    (115 2.25536291001 -8.50789302557 296.227754921)
    (120 2.3407191341 -8.48480639294 296.267030742)
    (125 2.42583912333 -8.46086343928 296.306306563)
    (130 2.51071428705 -8.43606658101 296.345582384)
    (135 2.59533605931 -8.41041832073 296.384858205)
    (140 2.67969589975 -8.38392124696 296.424134026)
    (145 2.76378529442 -8.35657803391 296.463409847)
    (150 2.84759575669 -8.32839144114 296.502685668)
    (155 2.93111882805 -8.29936431338 296.54196149)
    (160 3.01434607904 -8.26949958016 296.581237311)
    (165 3.09726911 -8.23880025554 296.620513132)
    (170 3.17987955202 -8.20726943782 296.659788953)
    (175 3.26216906772 -8.17491030923 296.699064774)
    (180 3.3441293521 -8.14172613558 296.738340595)
    (185 3.4257521334 -8.10772026595 296.777616416)
    (190 3.50702917392 -8.07289613235 296.816892237)
    (195 3.58795227085 -8.03725724937 296.847340468)
    (200 3.6685132571 -8.00080721383 296.877788699)
    (205 3.74870400214 -7.96354970442 296.90823693)
    (210 3.82851641278 -7.92548848132 296.93868516)
    (215 3.90794243404 -7.88662738581 296.969133391)
    (220 3.98697404992 -7.84697033993 297.10453757)
    (225 4.06560328422 -7.80652134601 297.397375672)
    (230 4.14382220138 -7.76528448634 297.690213774)
    (235 4.22162290721 -7.7232639227 297.983051876)
    (240 4.36877254913 -7.805121879 298.695515022)
    (245 4.53574184461 -7.91577787948 299.512884429)
    (250 4.70536638792 -8.02385123056 300.330253836)
    (255 4.87761098321 -8.1292998418 301.147623243)
    (260 5.05243985784 -8.23208207084 301.96499265)
    (265 5.20940183464 -8.30280372912 302.693294531)
    (270 5.28545006024 -8.25460083225 303.065326306)
    (275 5.36105229446 -8.20570140421 303.437358081)
    (280 5.43620215793 -8.15610957118 303.809389857)
    (285 5.51089330942 -8.10582951777 304.075682161)
    (290 5.58511944643 -8.05486548666 304.18336526)
    (295 5.65887430568 -8.00322177823 304.291048359)
    (300 5.73215166366 -7.95090275024 304.398731457)
    (305 5.80494533716 -7.89791281742 304.575150734)
    (310 5.87724918378 -7.84425645111 304.797394128)
    (315 5.94905710245 -7.78993817888 305.019637523)
    (320 6.02036303396 -7.73496258416 305.241880917)
    (325 6.09116096143 -7.67933430585 305.602330636)
    (330 6.16144491087 -7.62305803791 305.997331936)
    (335 6.23120895166 -7.56613852899 306.392333236)
    (340 6.30044719703 -7.50858058201 306.787334536)
    (345 6.30044719703 -7.50858058201 307.132254412)
    (350 6.30044719703 -7.50858058201 307.477174287)
    (355 6.30044719703 -7.50858058201 307.822094163)
    (360 6.30044719703 -7.50858058201 308.167014039)
    (365 6.30044719703 -7.50858058201 308.511933914)
    (370 6.30942064846 -7.52395224359 308.812214886)
    (375 6.35415548819 -7.6009034427 308.933940245)
    (380 6.39866936187 -7.67800909688 309.055665603)
    (385 6.44296190166 -7.75526870969 309.177390961)
    (390 6.48703274072 -7.83268178395 309.299116319)
    (395 6.53088151321 -7.91024782171 309.420841677)
    (400 6.57450785431 -7.98796632425 309.542567035)
    (405 6.61791140019 -8.06583679209 309.664292394)
    (410 6.66109178804 -8.14385872502 309.786017752)
    (415 6.70404865606 -8.22203162205 309.90774311)
    (420 6.74678164344 -8.30035498144 310.029468468)
    (425 6.78929039041 -8.37882830072 310.151193826)
    (430 6.80842215858 -8.41943903171 310.224009163)
    (435 6.82170002095 -8.45058760206 310.284596994)
    (440 6.83492969467 -8.48176492253 310.345184825)
    (445 6.84811114038 -8.51297093357 310.405772656)
    (450 6.8612443188 -8.54420557557 310.466360487)
    (455 6.87432919068 -8.57546878891 310.526948318)
    (460 6.88736571687 -8.60676051389 310.587536149)
    (465 6.90035385828 -8.63808069077 310.64812398)
    (470 6.91329357586 -8.66942925979 310.708711811)
    (475 6.92618483066 -8.70080616112 310.769299642)
    (480 6.93902758378 -8.73221133488 310.829887473)
    (485 6.95182179639 -8.76364472116 310.890475304)
    (490 6.96456742974 -8.79510626 310.951063135)
    (495 6.97726444512 -8.82659589139 311.011650966)
...
    (2000 6.52283820344 -4.69804623697 318.406907215)
