Fleming2020/20191225/precursor/constant/drivingData/qwallTable
    (0 (0 0 0.025875591497))
    (600 (0 0 0.0282102016385))
    (1200 (0 0 0.0305728327576))
    (1800 (0 0 0.0334526845673))
    (2400 (0 0 0.0220938703398))
    (3000 (0 0 0.0204255711644))
    (3600 (0 0 0.015318162007))
    (4200 (0 0 0.0795984257352))
    (4800 (0 0 0.0362023522189))
    (5400 (0 0 0.00173491673862))
    (6000 (0 0 0.0118858850159))
    (6600 (0 0 0.00145622669461))
    (7200 (0 0 -0.010211444419))
    (7800 (0 0 0.00798588500343))
    (8400 (0 0 -0.0401074284841))
    (9000 (0 0 -0.0972112310849))
    (9600 (0 0 0.00868732163189))
    (10200 (0 0 -0.0113384217551))
    (10800 (0 0 0.0341475951671))
    (11400 (0 0 -0.00786456728231))
    (12000 (0 0 -0.0158234353483))
    (12600 (0 0 -0.0249070859895))
    (13200 (0 0 -0.00526349969384))
    (13800 (0 0 -0.0217830287665))
    (14400 (0 0 -0.0697745677066))
    (15000 (0 0 -0.0671774092433))
    (15600 (0 0 -0.0571644905047))
    (16200 (0 0 -0.0627087604898))
    (16800 (0 0 -0.0794387500928))
    (17400 (0 0 -0.0913176131533))
    (18000 (0 0 -0.0701361750299))
    (18600 (0 0 -0.0437128159241))
    (19200 (0 0 -0.0893296549403))
    (19800 (0 0 -0.113613957805))
    (20400 (0 0 -0.0715892090109))
    (21000 (0 0 -0.0827392894404))
    (21600 (0 0 -0.147502090454))
    (22200 (0 0 -0.168805710984))
    (22800 (0 0 -0.130959267059))
    (23400 (0 0 -0.0824162713877))
    (24000 (0 0 -0.0787349426185))
    (24600 (0 0 -0.133933356858))
    (25200 (0 0 -0.105948853571))
    (25800 (0 0 -0.13399910814))
    (26400 (0 0 -0.104674806268))
    (27000 (0 0 -0.0928714981608))
    (27600 (0 0 -0.0679685429351))
    (28200 (0 0 -0.0985789796472))
    (28800 (0 0 -0.0909347210988))
    (29400 (0 0 -0.0720412094224))
    (30000 (0 0 -0.0608497393752))
    (30600 (0 0 -0.0888474165184))
    (31200 (0 0 -0.0382145671875))
    (31800 (0 0 -0.035567114853))
    (32400 (0 0 -0.0327264681131))
    (33000 (0 0 -0.0289354168021))
    (33600 (0 0 -0.0504071603852))
    (34200 (0 0 -0.0139045830285))
    (34800 (0 0 -0.00511582251226))
    (35400 (0 0 -0.00162973641708))
    (36000 (0 0 -0.00496088919971))
    (36600 (0 0 0.00232826391755))
    (37200 (0 0 0.00643212316695))
    (37800 (0 0 0.0153761053468))
    (38400 (0 0 0.0219183128785))
    (39000 (0 0 0.0152848923521))
    (39600 (0 0 0.019870779428))
    (40200 (0 0 0.119723129727))
    (40800 (0 0 0.0145112284454))
    (41400 (0 0 0.0202607965468))
    (42000 (0 0 0.0138104154929))
    (42600 (0 0 0.0632726764896))
    (43200 (0 0 0.0257643394168))
    (43800 (0 0 -0.00583187772338))
    (44400 (0 0 0.0120733538085))
    (45000 (0 0 0.020689923263))
    (45600 (0 0 0.0175978176402))
    (46200 (0 0 0.0175369868528))
    (46800 (0 0 0.0250538230191))
    (47400 (0 0 0.0212678877502))
    (48000 (0 0 0.0240419278996))
    (48600 (0 0 0.0228599190455))
    (49200 (0 0 0.0150897548286))
    (49800 (0 0 0.0134676849107))
    (50400 (0 0 0.016213809656))
    (51000 (0 0 0.00960459558786))
    (51600 (0 0 0.00941135952592))
    (52200 (0 0 0.00740002628226))
    (52800 (0 0 0.0103751237342))
    (53400 (0 0 0.00942981560294))
    (54000 (0 0 0.0116230265815))
    (54600 (0 0 0.0105097056045))
    (55200 (0 0 0.00544005333789))
    (55800 (0 0 0.00589160851834))
    (56400 (0 0 0.00359384553849))
    (57000 (0 0 0.00628060503649))
    (57600 (0 0 0.00543418658687))
    (58200 (0 0 0.00702647908652))
    (58800 (0 0 0.0228046339141))
    (59400 (0 0 0.0183572578562))
    (60000 (0 0 0.0286140032335))
    (60600 (0 0 0.0312734452942))
    (61200 (0 0 0.016628475113))
    (61800 (0 0 0.0063394796019))
    (62400 (0 0 -0.00528999847974))
    (63000 (0 0 0.00530539033333))
    (63600 (0 0 0.0196264165795))
    (64200 (0 0 0.0165798410787))
    (64800 (0 0 -0.00125338456417))
    (65400 (0 0 0.00125964868043))
    (66000 (0 0 0.00456781315783))
    (66600 (0 0 -0.00110959919948))
    (67200 (0 0 0.00164866731276))
    (67800 (0 0 0.00979956100069))
    (68400 (0 0 0.0163051201329))
    (69000 (0 0 0.0100231360334))
    (69600 (0 0 0.0108031059125))
    (70200 (0 0 0.00416210592752))
    (70800 (0 0 0.00969000048351))
    (71400 (0 0 0.00502835937813))
    (72000 (0 0 0.00662359030161))
    (72600 (0 0 0.00416066811028))
    (73200 (0 0 0.00778104971107))
    (73800 (0 0 0.00796949432532))
    (74400 (0 0 0.0082821481597))
    (75000 (0 0 0.00845580234663))
    (75600 (0 0 0.00722073264372))
    (76200 (0 0 0.0090355484569))
    (76800 (0 0 0.0141295740807))
    (77400 (0 0 0.00937465507634))
    (78000 (0 0 0.0130254512582))
    (78600 (0 0 0.0162402417437))
    (79200 (0 0 0.00734570533235))
    (79800 (0 0 -0.000771120094152))
    (80400 (0 0 0.00368714498082))
    (81000 (0 0 0.00292560896803))
    (81600 (0 0 0.00587428122367))
    (82200 (0 0 0.012183196651))
    (82800 (0 0 0.00589287923535))
    (83400 (0 0 0.00413683525118))
    (84000 (0 0 0.00101545620071))
    (84600 (0 0 0.000515744529044))
    (85200 (0 0 0.000398120575616))
    (85800 (0 0 0.00143536721784))
    (86400 (0 0 0.00846020571067))
    (87000 (0 0 0.00602954739523))
    (87600 (0 0 0.00759585733813))
    (88200 (0 0 0.00519415221896))
    (88800 (0 0 0.00322080668521))
    (89400 (0 0 0.00345890439598))
    (90000 (0 0 0.00190160276143))
    (90600 (0 0 0.00589681212806))
    (91200 (0 0 0.0282742752896))
    (91800 (0 0 0.0131695088103))
    (92400 (0 0 0.00749525271717))
    (93000 (0 0 -0.000198098535146))
    (93600 (0 0 0.0107737085855))
    (94200 (0 0 0.0109803940581))
    (94800 (0 0 0.00632957793955))
    (95400 (0 0 0.00645396048123))
    (96000 (0 0 0.00784230912935))
    (96600 (0 0 0.0110100473373))
    (97200 (0 0 0.00723400824536))
    (97800 (0 0 -0.00287340141958))
    (98400 (0 0 -0.0207646892172))
    (99000 (0 0 -0.0246889577606))
    (99600 (0 0 -0.00867852907184))
    (100200 (0 0 0.00438411579406))
    (100800 (0 0 -0.0182262139336))
    (101400 (0 0 -0.0237793287341))
    (102000 (0 0 -0.0533617932064))
    (102600 (0 0 -0.0286841143226))
    (103200 (0 0 -0.0223250664455))
    (103800 (0 0 -0.014018695959))
    (104400 (0 0 -0.0145417505493))
    (105000 (0 0 -0.0214192929273))
    (105600 (0 0 -0.018286484063))
    (106200 (0 0 -0.0605184017189))
    (106800 (0 0 -0.0733011199841))
    (107400 (0 0 -0.0821022972678))
    (108000 (0 0 -0.0890159234152))
