Fleming2020/20191225/precursor/system/sampling/surfaceProbe
    surfaceProbe
    {
          type                probes;
          functionObjectLibs ("libsampling.so");
          name                probe1;
          writeControl        timeStep;
          writeInterval       1;
          fields
          (
              T
              qwall
              Rwall
          );
          
          probeLocations
          (
                   (-133.802 101.012 0.0)
          );
    }
