Fleming2020/20191225/precursor/system/sampling/virtualMetMast_PL
    virtualmet
    {
          type                probes;
          functionObjectLibs ("libsampling.so");
          name                probe1;
          writeControl        timeStep;
          writeInterval       1;
          fields
          (
              U
              T
          );
          
          probeLocations
          (
              (-374.4 413.8 5.0)
              (-374.4 413.8 15.0)
              (-374.4 413.8 25.0)
              (-374.4 413.8 35.0)
              (-374.4 413.8 45.0)
              (-374.4 413.8 55.0)
              (-374.4 413.8 65.0)
              (-374.4 413.8 75.0)
              (-374.4 413.8 85.0)
              (-374.4 413.8 95.0)
              (-374.4 413.8 105.0)
              (-374.4 413.8 115.0)
              (-374.4 413.8 125.0)
              (-374.4 413.8 135.0)
              (-374.4 413.8 145.0)
              (-374.4 413.8 155.0)
              (-374.4 413.8 165.0)
              (-374.4 413.8 175.0)
              (-374.4 413.8 185.0)
              (-374.4 413.8 195.0)
              (-374.4 413.8 205.0)
              (-374.4 413.8 215.0)
              (-374.4 413.8 225.0)
              (-374.4 413.8 235.0)
              (-374.4 413.8 245.0)
              (-374.4 413.8 255.0)
              (-374.4 413.8 265.0)
              (-374.4 413.8 275.0)
              (-374.4 413.8 285.0)
              (-374.4 413.8 295.0)
              (-374.4 413.8 305.0)
              (-374.4 413.8 315.0)
              (-374.4 413.8 325.0)
              (-374.4 413.8 335.0)
              (-374.4 413.8 345.0)
              (-374.4 413.8 355.0)
              (-374.4 413.8 365.0)
              (-374.4 413.8 375.0)
              (-374.4 413.8 385.0)
              (-374.4 413.8 395.0)
              (-374.4 413.8 405.0)
              (-374.4 413.8 415.0)
              (-374.4 413.8 425.0)
              (-374.4 413.8 435.0)
              (-374.4 413.8 445.0)
              (-374.4 413.8 455.0)
              (-374.4 413.8 465.0)
              (-374.4 413.8 475.0)
              (-374.4 413.8 485.0)
              (-374.4 413.8 495.0)
              (-374.4 413.8 505.0)
              (-374.4 413.8 515.0)
              (-374.4 413.8 525.0)
              (-374.4 413.8 535.0)
              (-374.4 413.8 545.0)
              (-374.4 413.8 555.0)
              (-374.4 413.8 565.0)
              (-374.4 413.8 575.0)
              (-374.4 413.8 585.0)
              (-374.4 413.8 595.0)
              (-374.4 413.8 605.0)
              (-374.4 413.8 615.0)
              (-374.4 413.8 625.0)
              (-374.4 413.8 635.0)
              (-374.4 413.8 645.0)
              (-374.4 413.8 655.0)
              (-374.4 413.8 665.0)
              (-374.4 413.8 675.0)
              (-374.4 413.8 685.0)
              (-374.4 413.8 695.0)
              (-374.4 413.8 705.0)
              (-374.4 413.8 715.0)
              (-374.4 413.8 725.0)
              (-374.4 413.8 735.0)
              (-374.4 413.8 745.0)
              (-374.4 413.8 755.0)
              (-374.4 413.8 765.0)
              (-374.4 413.8 775.0)
              (-374.4 413.8 785.0)
              (-374.4 413.8 795.0)
              (-374.4 413.8 805.0)
              (-374.4 413.8 815.0)
              (-374.4 413.8 825.0)
              (-374.4 413.8 835.0)
              (-374.4 413.8 845.0)
              (-374.4 413.8 855.0)
              (-374.4 413.8 865.0)
              (-374.4 413.8 875.0)
              (-374.4 413.8 885.0)
              (-374.4 413.8 895.0)
              (-374.4 413.8 905.0)
              (-374.4 413.8 915.0)
              (-374.4 413.8 925.0)
              (-374.4 413.8 935.0)
              (-374.4 413.8 945.0)
              (-374.4 413.8 955.0)
              (-374.4 413.8 965.0)
              (-374.4 413.8 975.0)
              (-374.4 413.8 985.0)
              (-374.4 413.8 995.0)
              (-374.4 413.8 1005.0)
              (-374.4 413.8 1015.0)
              (-374.4 413.8 1025.0)
              (-374.4 413.8 1035.0)
              (-374.4 413.8 1045.0)
              (-374.4 413.8 1055.0)
              (-374.4 413.8 1065.0)
              (-374.4 413.8 1075.0)
              (-374.4 413.8 1085.0)
              (-374.4 413.8 1095.0)
              (-374.4 413.8 1105.0)
              (-374.4 413.8 1115.0)
              (-374.4 413.8 1125.0)
              (-374.4 413.8 1135.0)
              (-374.4 413.8 1145.0)
              (-374.4 413.8 1155.0)
              (-374.4 413.8 1165.0)
              (-374.4 413.8 1175.0)
              (-374.4 413.8 1185.0)
              (-374.4 413.8 1195.0)
              (-374.4 413.8 1205.0)
              (-374.4 413.8 1215.0)
              (-374.4 413.8 1225.0)
              (-374.4 413.8 1235.0)
              (-374.4 413.8 1245.0)
              (-374.4 413.8 1255.0)
              (-374.4 413.8 1265.0)
              (-374.4 413.8 1275.0)
              (-374.4 413.8 1285.0)
              (-374.4 413.8 1295.0)
              (-374.4 413.8 1305.0)
              (-374.4 413.8 1315.0)
              (-374.4 413.8 1325.0)
              (-374.4 413.8 1335.0)
              (-374.4 413.8 1345.0)
              (-374.4 413.8 1355.0)
              (-374.4 413.8 1365.0)
              (-374.4 413.8 1375.0)
              (-374.4 413.8 1385.0)
              (-374.4 413.8 1395.0)
              (-374.4 413.8 1405.0)
              (-374.4 413.8 1415.0)
              (-374.4 413.8 1425.0)
              (-374.4 413.8 1435.0)
              (-374.4 413.8 1445.0)
              (-374.4 413.8 1455.0)
              (-374.4 413.8 1465.0)
              (-374.4 413.8 1475.0)
              (-374.4 413.8 1485.0)
              (-374.4 413.8 1495.0)
              (-374.4 413.8 1505.0)
              (-374.4 413.8 1515.0)
              (-374.4 413.8 1525.0)
              (-374.4 413.8 1535.0)
              (-374.4 413.8 1545.0)
              (-374.4 413.8 1555.0)
              (-374.4 413.8 1565.0)
              (-374.4 413.8 1575.0)
              (-374.4 413.8 1585.0)
              (-374.4 413.8 1595.0)
              (-374.4 413.8 1605.0)
              (-374.4 413.8 1615.0)
              (-374.4 413.8 1625.0)
              (-374.4 413.8 1635.0)
              (-374.4 413.8 1645.0)
              (-374.4 413.8 1655.0)
              (-374.4 413.8 1665.0)
              (-374.4 413.8 1675.0)
              (-374.4 413.8 1685.0)
              (-374.4 413.8 1695.0)
              (-374.4 413.8 1705.0)
              (-374.4 413.8 1715.0)
              (-374.4 413.8 1725.0)
              (-374.4 413.8 1735.0)
              (-374.4 413.8 1745.0)
              (-374.4 413.8 1755.0)
              (-374.4 413.8 1765.0)
              (-374.4 413.8 1775.0)
              (-374.4 413.8 1785.0)
              (-374.4 413.8 1795.0)
              (-374.4 413.8 1805.0)
              (-374.4 413.8 1815.0)
              (-374.4 413.8 1825.0)
              (-374.4 413.8 1835.0)
              (-374.4 413.8 1845.0)
              (-374.4 413.8 1855.0)
              (-374.4 413.8 1865.0)
              (-374.4 413.8 1875.0)
              (-374.4 413.8 1885.0)
              (-374.4 413.8 1895.0)
              (-374.4 413.8 1905.0)
              (-374.4 413.8 1915.0)
              (-374.4 413.8 1925.0)
              (-374.4 413.8 1935.0)
              (-374.4 413.8 1945.0)
              (-374.4 413.8 1955.0)
              (-374.4 413.8 1965.0)
              (-374.4 413.8 1975.0)
              (-374.4 413.8 1985.0)
              (-374.4 413.8 1995.0)
          );
    }
